app/controllers/bill_types_controller.rb

  def index
    @bill_types = BillType.all
---
SELECT `bill_types`.* FROM `bill_types`

  def show
    @bill_type = BillType.find(params[:id])
---
SELECT `bill_types`.* FROM `bill_types` WHERE `bill_types`.`id` = 1 LIMIT 1

  def edit
    @bill_type = BillType.find(params[:id])
---
SELECT `bill_types`.* FROM `bill_types` WHERE `bill_types`.`id` = 1 LIMIT 1

  def create
    @bill_type = BillType.new(params[:bill_type])

    respond_to do |format|
      if @bill_type.save
---
INSERT INTO `bill_types` (`created_at`, `name`, `updated_at`) VALUES ('2013-07-20 13:08:38', 'Mobile Bill', '2013-07-20 13:08:38')

  def destroy
    @bill_type = BillType.find(params[:id])
    @bill_type.destroy
---
SELECT `bill_types`.* FROM `bill_types` WHERE `bill_types`.`id` = 2 LIMIT 1
DELETE FROM `bill_types` WHERE `bill_types`.`id` = 2